БухЭксп/InformationRegisters/CW_НаличиеФайловАрхиваПоОбъектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_НаличиеФайловАрхиваПоОбъектам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Признак</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_Платформа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_Платформа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Linux</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Windows</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОбъектыАрхива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОбъектыАрхива</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_ВладельцыАрхива</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла без расширения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Том</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТомаАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗахвачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийРедактор</Name>
					<Comment>Пользователь захвативший файл</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗагружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыДокументовФайловогоАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеПараметров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВОблаке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАрхиваВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОбъектыАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХраненияАрхива</Name>
					<Comment>0 - прикреплен,1 - в облаке; 2 - ссылка на ранее прикрепленный</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ТомаАрхива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ТомаАрхива</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЧтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платформа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_Платформа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_РаботаСФайламиСервер/Ext/Module.bsl
Функция ПолучитьОбщийМодульРаботыСфайлами() Экспорт
	    
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии") Тогда  
		Возврат CW_ОбщегоНазначения.ОбщийМодуль("ИнтеграцияShareКлиентСервер");
	КонецЕсли;

	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляБелоруси") Тогда  
		Возврат CW_ОбщегоНазначения.ОбщийМодуль("РаботаСФайламиСлужебныйКлиентСервер");
	КонецЕсли;
	
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляКазахстана") Тогда  
		Возврат CW_ОбщегоНазначения.ОбщийМодуль("РаботаСФайламиСлужебныйКлиентСервер");
	КонецЕсли; 
	
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляУзбекистана") Тогда  
		Возврат CW_ОбщегоНазначения.ОбщийМодуль("РаботаСФайламиСлужебныйКлиентСервер");
	КонецЕсли;
	
КонецФункции
 

Функция ПрикрепитьФайлы(ПрикрепляемыеФайлы, ОбъектыАрхива, ТипДокумента, Родитель=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОсновнойТомХранения = ПолучитьОсновнойТомХранения();
	
	Для Каждого ОбъектАрхива из ОбъектыАрхива Цикл   
		
		ВладелецАрхива = CW_РаботаСФайламиСервер.ПолучитьВладельцаАрхиваПоОбъекту(ОбъектАрхива);
		
		Для каждого ДанныеФайла Из ПрикрепляемыеФайлы Цикл
			ПрикрепитьФайл(ДанныеФайла, ОбъектАрхива, ТипДокумента, Родитель);	
		КонецЦикла;    
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат истина;
	
КонецФункции  

Функция ПрикрепитьФайл(ДанныеФайла, ОбъектАрхива, ТипДокумента, Родитель=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВладелецАрхива 			= CW_РаботаСФайламиСервер.ПолучитьВладельцаАрхиваПоОбъекту(ОбъектАрхива);
	ОсновнойТомХранения 	= ПолучитьОсновнойТомХранения();
	
	НачатьТранзакцию();
	
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ДанныеФайла.Хранение);
	РазмерБайт 			= ДвоичныеДанныеФайла.Размер(); 
	
	СсылкаНового = Справочники.CW_ОбъектыАрхива.ПолучитьСсылку(Новый УникальныйИдентификатор);	
	
	Успешно = ЗаписатьФайлВТомХранения(СсылкаНового, ДанныеФайла.Хранение, ОсновнойТомХранения); 
	Если Не Успешно Тогда   
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецЕсли;
	
	// создаем объект архива
	СпрОбъектыАрхива = Справочники.CW_ОбъектыАрхива.СоздатьЭлемент();  
	СпрОбъектыАрхива.Владелец 		= ВладелецАрхива;
	СпрОбъектыАрхива.Родитель 		= Родитель;
	СпрОбъектыАрхива.Объект 		= ОбъектАрхива;
	СпрОбъектыАрхива.ИмяФайла 		= ДанныеФайла.Имя;
	СпрОбъектыАрхива.Расширение 	= ДанныеФайла.Расширение;
	СпрОбъектыАрхива.Размер 		= РазмерБайт;
	СпрОбъектыАрхива.Наименование 	= ДанныеФайла.Имя;
	СпрОбъектыАрхива.Том 			= ОсновнойТомХранения;
	СпрОбъектыАрхива.ТипДокумента 	= ТипДокумента;  
	СпрОбъектыАрхива.ФайлЗагружен 	= Истина;    
	
	Если ДанныеФайла.Свойство("Комментарий") Тогда
		СпрОбъектыАрхива.Комментарий = ДанныеФайла.Комментарий;	
	КонецЕсли;
	
	СпрОбъектыАрхива.УстановитьСсылкуНового(СсылкаНового);
	СпрОбъектыАрхива.Записать(); 
	
	ЗаписатьНаличиеФайловПоОбъекту(ОбъектАрхива);
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();    
	Иначе
		СсылкаНового = Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СсылкаНового;
	
КонецФункции  

Процедура ДобавитьСсылкуНаФайл(ДанныеФайла, ОбъектАрхива, Родитель, ТипДокумента) Экспорт
	
	ВладелецАрхива = CW_РаботаСФайламиСервер.ПолучитьВладельцаАрхиваПоОбъекту(ОбъектАрхива);
	
	// создаем объект архива
	СпрОбъектыАрхива = Справочники.CW_ОбъектыАрхива.СоздатьЭлемент();
	СпрОбъектыАрхива.Владелец 		= ВладелецАрхива;
	СпрОбъектыАрхива.Объект 		= ОбъектАрхива;
	СпрОбъектыАрхива.ИмяФайла 		= ДанныеФайла.СсылкаНаФайл;
	СпрОбъектыАрхива.Наименование 	= ДанныеФайла.НаименованиеФайла;
	СпрОбъектыАрхива.Том 			= "";
	СпрОбъектыАрхива.Родитель 		= Родитель;
	СпрОбъектыАрхива.ТипДокумента 	= ТипДокумента;
	СпрОбъектыАрхива.ФайлЗагружен 	= Истина;
	СпрОбъектыАрхива.СпособХраненияАрхива = 1;
	СпрОбъектыАрхива.Записать();
	
	ЗаписатьналичиеФайловПоОбъекту(ОбъектАрхива);
	
КонецПроцедуры 

Процедура ДобавитьНаРанееПрикрепленныйФайл(ДобавлямыеСылки, ОбъектАрхива, Родитель) Экспорт

	ВладелецАрхива = CW_РаботаСФайламиСервер.ПолучитьВладельцаАрхиваПоОбъекту(ОбъектАрхива);
	
	Для Каждого ДобавляемаяСсылка из ДобавлямыеСылки Цикл 

		СпрОбъектыАрхива = ДобавляемаяСсылка.Скопировать(); 
		СпрОбъектыАрхива.Владелец 				= ВладелецАрхива;
		
		СпрОбъектыАрхива.Объект 				= ОбъектАрхива;
		СпрОбъектыАрхива.ОбъектАрхиваВладелец 	= ДобавляемаяСсылка; 
		СпрОбъектыАрхива.Родитель 				= Родитель; 
		
		СпрОбъектыАрхива.Автор  		 		= ПараметрыСеанса.ТекущийПользователь;
		СпрОбъектыАрхива.Редактор			 	= ПараметрыСеанса.ТекущийПользователь;
		СпрОбъектыАрхива.ДатаРегистрации 		= ТекущаяДата();
		СпрОбъектыАрхива.ДатаИзменения   		= ТекущаяДата();  
		СпрОбъектыАрхива.СпособХраненияАрхива 	= 2;
		СпрОбъектыАрхива.Записать(); 
	КонецЦикла;  
	
	ЗаписатьналичиеФайловПоОбъекту(ОбъектАрхива);
	
	
КонецПроцедуры

Процедура ОбновитьДанныеСуществующегоФайла(ОбъектыАрхиваСсылка, ДанныеФайла) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);  
	
	Успешно = ЗаписатьФайлВТомХранения(ОбъектыАрхиваСсылка, ДанныеФайла.Хранение, ДанныеФайла.Том); 
	Если Не Успешно Тогда
		Возврат;
	КонецЕсли;
	
	СпрОбъектыАрхива = ОбъектыАрхиваСсылка.ПолучитьОбъект(); 
	
	ДанныеФайла.Свойство("Наименование", 	СпрОбъектыАрхива.Наименование);
	ДанныеФайла.Свойство("ИмяФайла", 		СпрОбъектыАрхива.ИмяФайла);
	ДанныеФайла.Свойство("Расширение", 		СпрОбъектыАрхива.Расширение);
	ДанныеФайла.Свойство("Комментарий", 	СпрОбъектыАрхива.Комментарий);
	ДанныеФайла.Свойство("Размер", 			СпрОбъектыАрхива.Размер);
	ДанныеФайла.Свойство("Том", 			СпрОбъектыАрхива.Том);
	ДанныеФайла.Свойство("ТипДокумента", 	СпрОбъектыАрхива.ТипДокумента);
	
	СпрОбъектыАрхива.ФайлЗагружен 	= Истина;    
	СпрОбъектыАрхива.Записать(); 
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры  


Процедура УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(Форма) Экспорт
	
	Объект = Форма.Объект;
	АдресКартинкиФайлов 		= ПолучитьАдресКартинкиФайлов(Объект.Ссылка, Форма.УникальныйИдентификатор);
	Форма.АдресКартинкиФайлов  	= АдресКартинкиФайлов;
	
КонецПроцедуры

Функция ПолучитьАдресКартинкиФайлов(ОбъектАрхива, УникальныйИдентификатор) Экспорт
	
	ЕстьФайлы = Справочники.CW_ОбъектыАрхива.ЕстьПрикрикрепленныеФайлыОбъекта(ОбъектАрхива);
	
	КартинкаФайлов = БиблиотекаКартинок.CW_СерыйПлюс;
	Если ЕстьФайлы Тогда
		КартинкаФайлов = БиблиотекаКартинок.CW_Архив;
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(КартинкаФайлов, УникальныйИдентификатор);
	
КонецФункции

Процедура ЗаписатьНаличиеФайловПоОбъекту(ОбъектАрхива) Экспорт
	
	Запись = РегистрыСведений.CW_НаличиеФайловАрхиваПоОбъектам.СоздатьМенеджерЗаписи();
	Запись.Объект = ОбъектАрхива;
	Запись.Признак = Истина;
	Запись.Записать(Истина);
	
КонецПроцедуры

Функция ЗапрашиватьТипФайлаПриДобавленииВАрхив() Экспорт
	
	Возврат Константы.CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив.Получить();
	
КонецФункции


Функция ПолучитьВладельцаАрхиваПоОбъекту(Ссылка, Создавать=Истина) Экспорт
	
	НайденныйЭлемент = Справочники.CW_ВладельцыАрхива.НайтиПоРеквизиту("ОбъектАрхива", Ссылка);
	Если НайденныйЭлемент.Пустая() Тогда
		Если Создавать Тогда
			НовыйОбъект = Справочники.CW_ВладельцыАрхива.СоздатьЭлемент();
			НовыйОбъект.ОбъектАрхива = Ссылка; 
			НовыйОбъект.Записать();
			
			НайденныйЭлемент = НовыйОбъект.Ссылка;
		КонецЕсли;                                
	КонецЕсли;                                
	
	Возврат НайденныйЭлемент;

КонецФункции

Функция ЗаписатьФайлВТомХранения(ОбъектАрхива, АдресВхранилище, ОсновнойТомХранения) Экспорт 
	
	Если Не ТомХраненияДоступенДляЗаписи(ОсновнойТомХранения) Тогда
		Возврат Ложь;
	КонецЕсли;   
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВхранилище);
	
	ПолноеИмяФайла = ПолучитьПолноеИмяФайла(ОбъектАрхива, ОсновнойТомХранения);
	
	Попытка
		ДвоичныеДанные.Записать(ПолноеИмяФайла); 
	Исключение
		Возврат Ложь;
	КонецПопытки; 
	
	Возврат Истина;	
	
КонецФункции

Функция ТомХраненияДоступенДляЗаписи(ТомХранения) Экспорт 
	
	Если ТомХранения.Пустая() 
		или ТомХранения.ТолькоЧтение 
		или Не ТомХранения.Активный Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ДанныеФайла(Знач ПрисоединенныйФайл) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка",                       ПрисоединенныйФайл);
	Результат.Вставить("СпособХранения",               ПрисоединенныйФайл.СпособХраненияАрхива);
	Результат.Вставить("ИмяФайла",                     ПрисоединенныйФайл.ИмяФайла); 
	Результат.Вставить("ИмяФайлаДляСохранения",	   	   ?(ПрисоединенныйФайл.СпособХраненияАрхива=1, ПрисоединенныйФайл.Наименование,ПрисоединенныйФайл.ИмяФайла));
	Результат.Вставить("Наименование",                 ПрисоединенныйФайл.Наименование);
	Результат.Вставить("Расширение",                   ПрисоединенныйФайл.Расширение);
	Результат.Вставить("Размер",                       ПрисоединенныйФайл.Размер);
	Результат.Вставить("ПометкаУдаления",              ПрисоединенныйФайл.ПометкаУдаления);
	Результат.Вставить("НавигационнаяСсылка", 		   ПолучитьНавигационнуюСсылку(ПрисоединенныйФайл));
	
	Возврат Результат;
	
КонецФункции  

Функция ДвоичныеДанныеФайла(ПрисоединенныйФайл) Экспорт
	
	ПолноеИмяФайла = ПолучитьПолноеИмяФайла(ПрисоединенныйФайл); 
	Файл = Новый Файл(ПолноеИмяФайла);
	Если Файл.Существует() Тогда
		Возврат Новый ДвоичныеДанные(ПолноеИмяФайла);	
	КонецЕсли;  

КонецФункции  

Функция ПолучитьСсылкуНаДвоичныеДанные(ПрисоединенныйФайл, Знач УникальныйИдентификатор=Неопределено) Экспорт  
	
	Если УникальныйИдентификатор = Неопределено Тогда
		УникальныйИдентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	ДвоичныеДанные = ДвоичныеДанныеФайла(ПрисоединенныйФайл);
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
КонецФункции


Функция ПолучитьПолноеИмяФайла(ПрисоединенныйФайл, Знач ТомХранения = Неопределено) Экспорт 

	Если ТомХранения = Неопределено Тогда
		ТомХранения = ПолучитьТомХраненияФайла(ПрисоединенныйФайл); 
	КонецЕсли; 
	
	ИмяФайлаВТоме 		= ПолучитьИмяФайлаВТоме(ПрисоединенныйФайл);
	ДанныеТомаХранения 	= ПолучитьДанныеТомаХраненияФайла(ТомХранения); 
	
	Возврат ДанныеТомаХранения.КаталогТома + ИмяФайлаВТоме;
	
КонецФункции  

Функция ПолучитьИмяФайлаВТоме(ПрисоединенныйФайл)

	Если Не ЗначениеЗаполнено(ПрисоединенныйФайл.ОбъектАрхиваВладелец) Тогда  
		Возврат Строка(ПрисоединенныйФайл.УникальныйИдентификатор());
	Иначе
		Возврат ПолучитьИмяФайлаВТоме(ПрисоединенныйФайл.ОбъектАрхиваВладелец);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТомХраненияФайла(ПрисоединенныйФайл)
	
	Если Не ЗначениеЗаполнено(ПрисоединенныйФайл.ОбъектАрхиваВладелец) Тогда  
		Возврат ПрисоединенныйФайл.Том;
	Иначе
		Возврат ПолучитьТомХраненияФайла(ПрисоединенныйФайл.ОбъектАрхиваВладелец);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеТомаХраненияФайла(ТомХранения) Экспорт
	
	Если ТомХранения.Платформа = Перечисления.CW_Платформа.Linux Тогда
		Разделитель = "/";
	Иначе
		Разделитель = "\";
	КонецЕсли; 
	
	ДанныеТомаХранения = Новый Структура;
	ДанныеТомаХранения.Вставить("ТомХранения", ТомХранения);
	ДанныеТомаХранения.Вставить("КаталогТома", ТомХранения.Путь+Разделитель);
	
	Возврат ДанныеТомаХранения;
	
КонецФункции    

Функция ПолучитьОсновнойТомХранения() Экспорт 
	
	Возврат Справочники.CW_ТомаАрхива.ПолучитьОсновнойТомХранения();
	
КонецФункции    

Процедура ЗаменитьЗапрещенныеСимволыИмениФайла(ИмяФайла, СтрокаЗамены="_") Экспорт 

	ИмяФайла = СтрЗаменить(ИмяФайла, "/", "_");
	ИмяФайла = СтрЗаменить(ИмяФайла, "\", "_");
	ИмяФайла = СтрЗаменить(ИмяФайла, ":", "_");
	ИмяФайла = СтрЗаменить(ИмяФайла, "*", "_");
	ИмяФайла = СтрЗаменить(ИмяФайла, "?", "_");
	ИмяФайла = СтрЗаменить(ИмяФайла, """", "_");
	ИмяФайла = СтрЗаменить(ИмяФайла, "<", "_");
	ИмяФайла = СтрЗаменить(ИмяФайла, ">", "_");
	ИмяФайла = СтрЗаменить(ИмяФайла, "|", "_");
	
КонецПроцедуры
